Dmivaka/STM32H7-ETH-LWIP/Src/main.c
  }
  
  /*
  CanardRxSubscription heartbeat_msg_subscription;
  if( canardRxSubscribe(        &canard,
                                CanardTransferKindMessage,
                                uavcan_node_Heartbeat_1_0_FIXED_PORT_ID_,
                                uavcan_node_Heartbeat_1_0_EXTENT_BYTES_,
                                CANARD_DEFAULT_TRANSFER_ID_TIMEOUT_USEC,
                                &heartbeat_msg_subscription) != 1 ){ Error_Handler(); }  
  */

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  uint8_t message_transfer = 0;
  uint32_t timestamp = HAL_GetTick();
  while (1)
  {
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
    if( HAL_GetTick() > timestamp )
    {
      //LL_GPIO_SetOutputPin(GPIOD, LL_GPIO_PIN_6);
      //HAL_SPI_Transmit_DMA(&hspi1, SPI_TX_buf, 512);
      
      //conke(); // debug transmition of sample data
      timestamp += 1000;
    }
    
    MX_LWIP_Process();
    
    if( LCM_rx_flag )
    {
      uint8_t c_serialized[uavcan_primitive_array_Real32_1_0_EXTENT_BYTES_] = {0};
      
      uavcan_primitive_array_Real32_1_0 uavcan_tx_array;
      uavcan_tx_array.value.count = 5;
      
      for( int i = 0; i < 12; i++)
      {
        if( device_to_queue[i] >= 0 ) // check if selected drive is ebabled 
        {
          uavcan_tx_array.value.elements[0] = rx_lcm_msg.act[i].position;
          uavcan_tx_array.value.elements[1] = rx_lcm_msg.act[i].velocity;
          uavcan_tx_array.value.elements[2] = rx_lcm_msg.act[i].torque;
          uavcan_tx_array.value.elements[3] = rx_lcm_msg.act[i].kp;
          uavcan_tx_array.value.elements[4] = rx_lcm_msg.act[i].kd;
          
          size_t c_serialized_size = uavcan_primitive_array_Real32_1_0_EXTENT_BYTES_;

          if ( uavcan_primitive_array_Real32_1_0_serialize_( &uavcan_tx_array, c_serialized, &c_serialized_size) < 0)
          {
            Error_Handler();
          }
          
          const CanardTransferMetadata transfer_metadata = {    .priority       = CanardPriorityHigh,
                                                                .transfer_kind  = CanardTransferKindMessage,
                                                                .port_id        = device_tx_port[i],
                                                                .remote_node_id = CANARD_NODE_ID_UNSET,
                                                                .transfer_id    = message_transfer }; 

          if(canardTxPush(  TxQueuesMap[device_to_queue[i]],
                            &canard,
                            0,
                            &transfer_metadata,
                            c_serialized_size,
                            c_serialized) < 0 )
                            {
                              Error_Handler();
                            }
          
          process_canard_TX_queue( device_to_queue[i] );
        }
      }
      
      message_transfer++ ;
      LCM_rx_flag = 0;
      
      response_recorder = 0;
    }
    
    if( LCM_tx_flag )
    {
      conke();
      LCM_tx_flag = 0;
    }
    
    /*
    if( gaga.bytes_written > 70 )
    {
      udp_client_send();
      __HAL_TIM_SET_COUNTER(&htim1, 0);
    }
    else if( timer_update_flag )
    {
      udp_client_send();
      timer_update_flag = 0;
    }
    */
    
    /// retrieve and process frames from the on-chip FDCAN peripherals
    for( int i = 0; i < 3; i++)
    {
      while( HAL_FDCAN_GetRxFifoFillLevel(FDCAN_Handles_Map[i], FDCAN_RX_FIFO0) > 0 )
      {
        FDCAN_RxHeaderTypeDef Header;
        uint8_t RxData[64];
    
        if (HAL_FDCAN_GetRxMessage(FDCAN_Handles_Map[i], FDCAN_RX_FIFO0, &Header, RxData) != HAL_OK){ Error_Handler(); }

        // separate frames into the LCM and UAVCAN -related buffers
        if( !parse_canard_frame( Header.Identifier, LengthDecoder(Header.DataLength), RxData ) )
        {
          // the canard frames filter said it is not the canard frame and returned 0.
          // we have to put this frame untouched into UDP TX chain
          uint8_t local_buffer[69] = {0};
          uint8_t msg_len = serialize_can_frame(  1, 
                                                  Header.Identifier, 
                                                  LengthDecoder(Header.DataLength), 
                                                  RxData, 
                                                  local_buffer);

          write_buffer(&UDP_TX_ring, local_buffer, msg_len);
        }
      }
    }
    
    /// processing of the serialized FDCAN frames from companion chip (SPI RX chain)
    while( SPI_RX_buf.bytes_written > 0 )
    {
      uint8_t local_buffer[69] = {0};
      uint8_t frame_length = 0;
      
      uint32_t primask_bit = __get_PRIMASK();  // backup PRIMASK bit
      __disable_irq();                  // Disable all interrupts by setting PRIMASK bit on Cortex
      
        frame_length = SPI_RX_buf.buffer_body[SPI_RX_buf.head]; // get the frame length, it's located at the beginning of new frame in the buffer
        if( frame_length > SPI_RX_buf.bytes_written )
        {
          // buffer is corrupted
          Error_Handler();
        }
        read_buffer(&SPI_RX_buf, local_buffer, frame_length);
        
      __set_PRIMASK(primask_bit);     // Restore PRIMASK bit

      uint32_t identifier;
      size_t size;
      uint8_t RxData[69];
      deserialize_can_frame( NULL, &identifier, &size, RxData, local_buffer);
        
      // separate frames into the LCM and UAVCAN -related buffers
      if( !parse_canard_frame( identifier, size, RxData ) )
      {
        // the canard frames filter said it is not the canard frame and returned 0.
        // we have to put this frame untouched into UDP TX chain
        write_buffer(&UDP_TX_ring, local_buffer, frame_length);
      }

      /// the rest is debug errors check
      if( frame_length != 13 )
      {
        Error_Handler();
      }

      if( previos_char == local_buffer[10] )
      {
        Error_Handler();
      }
      previos_char = local_buffer[10];
      
      debug_collector[debug_index] = previos_char;
      debug_index++;
      if( debug_index > 1023 )
      {
        debug_index = 0;
      }
    }

    /// break UDP TX ring buffer into a bunch of UDP frames each smaller than 512 bytes and send them out
    /// right now data is sent only when buffer is full
    while( UDP_TX_ring.bytes_written > 0 )
    {
      uint16_t length = UDP_TX_ring.buffer_body[UDP_TX_ring.head];
      if( index + length < 512 )
      {
         read_buffer(&UDP_TX_ring, &udp_out_buffer[index], length);
         index += length;
      }
      else
      {
        //send buffer
        struct pbuf *p = pbuf_alloc(PBUF_TRANSPORT, index, PBUF_RAM); // allocate LWIP memory for outgoing UDP packet
        
        if (p != NULL)
        {
          pbuf_take(p, (void *) udp_out_buffer, index);
          udp_send(upcb, p);
          pbuf_free(p);         
          index = 0;
        }
      }
    }
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

